RedditClone/app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        @post.sub_id = params[:sub_id]
        if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "Money"], ["url", "money.com"], ["content", "we love money"], ["user_id", 2], ["sub_id", 2], ["created_at", "2019-03-05 19:41:28.018624"], ["updated_at", "2019-03-05 19:41:28.018624"]]