RedditClone/app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "mdWS_-plTPzmab-XMdU0gg"], ["updated_at", "2019-03-05 18:47:20.178661"], ["id", 1]]
---
    def reset_session_token!
        self.update!(session_token: User.generate_session_token)